china-djyos/djyos/bsp/cpudrv/imxrt/1050/src/eth/cpu_peri_eth.c
//----------------------------------------------------
// Copyright (c) 2014, SHENZHEN PENGRUI SOFT CO LTD. All rights reserved.

// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions are met:

// 1. Redistributions of source code must retain the above copyright notice,
//    this list of conditions and the following disclaimer.
// 2. Redistributions in binary form must reproduce the above copyright notice,
//    this list of conditions and the following disclaimer in the documentation
//    and/or other materials provided with the distribution.

// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
// AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
// IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
// ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
// LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
// CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
// SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
// INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
// CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
// ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
// POSSIBILITY OF SUCH DAMAGE.
//-----------------------------------------------------------------------------
// Copyright (c) 2014 著作权由深圳鹏瑞软件有限公司所有。著作权人保留一切权利。
//
// 这份授权条款，在使用者符合下列条件的情形下，授予使用者使用及再散播本
// 软件包装原始码及二进位可执行形式的权利，无论此包装是否经改作皆然：
//
// 1. 对于本软件源代码的再散播，必须保留上述的版权宣告、本条件列表，以
//    及下述的免责声明。
// 2. 对于本套件二进位可执行形式的再散播，必须连带以文件以及／或者其他附
//    于散播包装中的媒介方式，重制上述之版权宣告、本条件列表，以及下述
//    的免责声明。

// 免责声明：本软件是本软件版权持有人以及贡献者以现状（"as is"）提供，
// 本软件包装不负任何明示或默示之担保责任，包括但不限于就适售性以及特定目
// 的的适用性为默示性担保。版权持有人及本软件之贡献者，无论任何条件、
// 无论成因或任何责任主义、无论此责任为因合约关系、无过失责任主义或因非违
// 约之侵权（包括过失或其他原因等）而起，对于任何因使用本软件包装所产生的
// 任何直接性、间接性、偶发性、特殊性、惩罚性或任何结果的损害（包括但不限
// 于替代商品或劳务之购用、使用损失、资料损失、利益损失、业务中断等等），
// 不负任何责任，即在该种使用已获事前告知可能会造成此类损害的情形下亦然。
//-----------------------------------------------------------------------------
// =============================================================================
// =============================================================================
// Copyright (C) 2012-2020 长园继保自动化有限公司 All Rights Reserved
// 文件名     ：cpu_peri_eth.c
// 模块描述: MAC模块底层硬件驱动，为DJYIP的协议栈特定的驱动
// 模块版本: V1.00
// 创建人员: chj
// 创建时间: 05/14.2018
// =============================================================================
#include <stdio.h>
#include <stddef.h>
#include <stdint.h>
#include <string.h>

#include <sys/socket.h>
#include <cpu_peri.h>
#include "cpu_peri_int_line.h"
#include <board-config.h>

#include "fsl_clock.h"
#include "cpu_peri_eth.h"
#include "dbug.h"
#include "project_config.h"    //本文件由IDE中配置界面生成，存放在APP的工程目录中。
                                //允许是个空文件，所有配置将按默认值配置。

//@#$%component configure   ****组件配置开始，用于 DIDE 中图形化配置界面
//****配置块的语法和使用方法，参见源码根目录下的文件：component_config_readme.txt****
//%$#@initcode      ****初始化代码开始，由 DIDE 删除“//”后copy到初始化文件中
//  extern bool_t ModuleInstall_ETH(const char *devname, u8 *macaddress,\
//                       tagPhyMessage  *phy,
//                          bool_t loop,u32 loopcycle,\
//                          bool_t (*rcvHook)(u8 *buf, u16 len));
//    static u8 ImxMac[] = {CFG_MAC_ADDR0,CFG_MAC_ADDR1,CFG_MAC_ADDR2,CFG_MAC_ADDR3,\
//                          CFG_MAC_ADDR4,CFG_MAC_ADDR5};
//    static tagPhyMessage Phy = {CFG_IMX_PHY_SPEED,CFG_IMX_PHY_DUPLEX};
//    ModuleInstall_ETH(CFG_ETH_DEV_NAME,ImxMac,&Phy,CFG_LOOP_CYCLE,NULL);
//%$#@end initcode  ****初始化代码结束

//%$#@describe      ****组件描述开始
//component name:"cpu_peri_eth"     //CPU的mac驱动
//parent:none                       //填写该组件的父组件名字，none表示没有父组件
//attribute:bsp组件                 //选填“第三方组件、核心组件、bsp组件、用户组件”，本属性用于在IDE中分组
//select:可选                       //选填“必选、可选、不可选”，若填必选且需要配置参数，则IDE裁剪界面中默认勾取，
                                    //不可取消，必选且不需要配置参数的，或是不可选的，IDE裁剪界面中不显示，
//grade:init                        //初始化时机，可选值：none，init，main。none表示无须初始化，
                                    //init表示在调用main之前，main表示在main函数中初始化
//dependence:"djyip","lock","int",  //该组件的依赖组件名（可以是none，表示无依赖组件），
                                    //如果依赖多个组件，则依次列出
//mutex:"none"                      //该组件的依赖组件名（可以是none，表示无依赖组件），
                                    //如果依赖多个组件，则依次列出
//%$#@end describe  ****组件描述结束

//%$#@configue      ****参数配置开始
//%$#@target = header              //header = 生成头文件,cmdline = 命令行变量，DJYOS自有模块禁用
#ifndef CFG_MAC_ADDR0      //****检查参数是否已经配置好
#warning    cpu_peri_eth组件参数未配置，使用默认值
//%$#@num,0,255,
#define CFG_MAC_ADDR0             00//"网卡MAC地址0",
#define CFG_MAC_ADDR1             00//"网卡MAC地址1",
#define CFG_MAC_ADDR2             00//"网卡MAC地址2",
#define CFG_MAC_ADDR3             00//"网卡MAC地址3",
#define CFG_MAC_ADDR4             00//"网卡MAC地址4",
#define CFG_MAC_ADDR5             00//"网卡MAC地址5",
//%$#@num,1000,10000,
#define CFG_LOOP_CYCLE            1000//"读网卡loop时间",
//%$#@enum,1,0,
#define CFG_IMX_PHY_SPEED          1//"配置phy速度",为1表示100M，为0表示10M
#define CFG_IMX_PHY_DUPLEX         1//"配置全/半双工模式",为1表示全双工，为0表示半双工
//%$#@string,1,30,
#define CFG_ETH_DEV_NAME          "ETH_DEV_IMXRT1052"//"网卡名称",注册网卡的设备名称
//%$#select,        ***定义无值的宏，仅用于第三方组件
//%$#@free,
#endif
//%$#@end configue  ****参数配置结束
//@#$%component end configure
// =============================================================================

#define CN_DEVNAME_LEN 32

#define ETH_RING_NUM        (FSL_FEATURE_ENET_QUEUE)
#define CORE_CLK_FREQ       CLOCK_GetFreq(kCLOCK_AhbClk)
//this is the mac receive hook, if any hook rcv,then the data will goto the hook
//the receive data goto the stack default
typedef bool_t (*fnRcvDeal)(u8 *buf, u16 len);

typedef struct
{
    vu32  Ints;                     //the int counter
    vu32  rcvInts;                  //rcv ints counter
    vu32  dmaerr;                   //dmaerr ins counter
    vu32  rxoverInts;               //rcv over ints counter
    vu32  rcvPkgTimes;              //rcv package times
    vu32  sndTimes;                 //the snd times counter
    vu32  sndOkTimes;               //the send success counter
    vu32  sndnobdCnt;               //not enough bd rings
    vu32  sndPkgTooLongCnt;         //snd pkg too long ounter
    vu32  sndInts;                  //the send ints counter
    vu32  rxTaskRun;                //the rx task run counter
    vu32  rsttimes;                 //the reset counter
    vu32  nopkgCnts;                //the no pkg free
}tagMacDebug;

typedef struct
{
    ENET_Type*      base;
    enet_handle_t   handle;
    enet_config_t   config;
    enet_buffer_config_t    buffConfig[ETH_RING_NUM];
}tagEthHandle;

typedef struct
{
    //os member
    struct SemaphoreLCB     *rcvsync;          //activate the receive task
    struct MutexLCB         *protect;          //protect the device
    ptu32_t                 devhandle;        //returned by the tcpip stack
    char                    devname[CN_DEVNAME_LEN];
    //hardware
    tagEthHandle            *EthHandle;
    //which used to descript the device or control the device
    struct devstat
    {
        vu32 pm:1;        //1 copy all the frame ,no addr filter
        vu32 bfd:1;       //1 broadcast frames disable
        vu32 duplex:1;    //1 full while 0 half
        vu32 speed:1;     //1 means 100Mb while 0 10 Mb
        vu32 mii:1;       //1 means mii mode while 0 rmii mode
    }macstat;
    u8            macaddr[CN_MACADDR_LEN];    //storage the mac address
    //dev method
    vu32 loop:1;          //1 use the loop mode while 0 interrupt mode
    vu32 loopcycle:31;    //unit:ms
    fnRcvDeal     fnrcvhook;                  //rcv hook function
    tagMacDebug   debuginfo;                  //debug info
}tagMacDriver;
static tagMacDriver  gMacDriver;

//define the descriptors and buffers
#define EthRxDescs      (8U)
#define EthTxDescs      (8U)
#define EthRxBufSize    ENET_FRAME_MAX_FRAMELEN
#define EthTxBufSize    ENET_FRAME_MAX_FRAMELEN

/*! @brief Buffer descriptors should be in non-cacheable region and should be align to "ENET_BUFF_ALIGNMENT". */
AT_NONCACHEABLE_SECTION_ALIGN(enet_rx_bd_struct_t RxDscrTab[EthRxDescs], ENET_BUFF_ALIGNMENT);
AT_NONCACHEABLE_SECTION_ALIGN(enet_tx_bd_struct_t TxDscrTab[EthTxDescs], ENET_BUFF_ALIGNMENT);

SDK_ALIGN(u8 Rx_Buff[EthRxDescs][SDK_SIZEALIGN(EthRxBufSize, ENET_BUFF_ALIGNMENT)],\
                                                        ENET_BUFF_ALIGNMENT);
SDK_ALIGN(u8 Tx_Buff[EthTxDescs][SDK_SIZEALIGN(EthTxBufSize, ENET_BUFF_ALIGNMENT)],\
                                                        ENET_BUFF_ALIGNMENT);
static u8 gTxBuffer[EthRxBufSize];      //for sending copy frame
 tagEthHandle   sEthHandle={
    .buffConfig[0]={
            EthRxDescs,
            EthTxDescs,
            SDK_SIZEALIGN(EthRxBufSize, ENET_BUFF_ALIGNMENT),
            SDK_SIZEALIGN(EthTxBufSize, ENET_BUFF_ALIGNMENT),
            &RxDscrTab[0],
            &TxDscrTab[0],
            &Rx_Buff[0][0],
            &Tx_Buff[0][0],
    },
};

static void ETH_HardDrvInit(tagMacDriver *pDrive)
{
    // configure ethernet peripheral (GPIOs, clocks, MAC)
    ENET_Init(  pDrive->EthHandle->base,    \
                &pDrive->EthHandle->handle, \
                &pDrive->EthHandle->config, \
                pDrive->EthHandle->buffConfig,\
                pDrive->macaddr,            \
                CORE_CLK_FREQ);

    /* 初始化后默认使能接收，发送在发送函数中使能 */
    ENET_ActiveRead(pDrive->EthHandle->base);
}

void EthOutClkToPhy(ENET_Type* base,u32 freq)
{
    u8 loopdiv=0;
    clock_enet_pll_config_t config = {true, false, 0};
    switch(freq)
    {
        case (25*Mhz):
                loopdiv = 0;
                break;
        case (50*Mhz):
                loopdiv=1;
                break;
        case (100*Mhz):
                loopdiv=2;
                break;
        case (125*Mhz):
                loopdiv=3;
                break;
        default:
            return;
    }
    config.loopDivider = loopdiv;
    CLOCK_EnableClock(kCLOCK_Enet);
    CLOCK_InitEnetPll(&config);
}

