china-djyos/djyos/bsp/cpudrv/imxrt/1050/src/eth/cpu_peri_eth.c
static void __MacReset(tagMacDriver *pDrive)
{
    if(Lock_MutexPend(pDrive->protect,CN_TIMEOUT_FOREVER))
    {
        ETH_HardDrvInit(pDrive);
        pDrive->debuginfo.rsttimes++;
        Lock_MutexPost(pDrive->protect);
    }
    return ;
}

 static tagNetPkg *__MacRcv(ptu32_t devhandle)
{
    tagNetPkg         *pkg = NULL;
    tagMacDriver      *pDrive;
    tagEthHandle *EthHandle;
    status_t status;
    enet_data_error_stats_t eErrStatic;
    u32  len=0;
    u8   *dst;

    pDrive = &gMacDriver;
    EthHandle = pDrive->EthHandle;
    // get received frame
    status = ENET_GetRxFrameSize(&EthHandle->handle, &len);
    //len = EthHandle->handle.rxBdCurrent[0]->length;
    if (status == kStatus_ENET_RxFrameError)
    //if(len==0)
    {
        /* Update the received buffer when error happened. */
        /* Get the error information of the received g_frame. */
        ENET_GetRxErrBeforeReadFrame(&EthHandle->handle, &eErrStatic);
        /* update the receive buffer. */
        ENET_ReadFrame(EthHandle->base, &EthHandle->handle, NULL, 0);
        return NULL;
    }

    if(len > 0)
    {
        pkg = PkgMalloc(len,CN_PKLGLST_END);
        if(NULL == pkg)
            pDrive->debuginfo.nopkgCnts++;
    }

    if(NULL != pkg)
    {
        dst = (u8 *)(pkg->buf +pkg->offset);
        status = ENET_ReadFrame(EthHandle->base, &EthHandle->handle, dst, len);
        pkg->datalen = len;
    }

    return pkg;
}

static bool_t MacSnd(ptu32_t handle,tagNetPkg * pkg,u32 framelen, u32 netdevtask)
{
    bool_t             result;
    tagMacDriver      *pDrive;
    tagEthHandle    *EthHandle;
    tagNetPkg         *tmppkg;
    u8                *dst,*src;
    u16                len=0;

    result = false;
    pDrive = &gMacDriver;
    EthHandle = pDrive->EthHandle;
    pDrive->debuginfo.sndTimes++;
    if((0 == handle)||(NULL == pkg))
        return result;

    if(Lock_MutexPend(pDrive->protect,CN_TIMEOUT_FOREVER))
    {
        if(EthHandle->handle.txBdCurrent[0]->control & \
                ENET_BUFFDESCRIPTOR_TX_READY_MASK)
        {
            pDrive->debuginfo.sndnobdCnt ++;
            goto NODESCERROR;
        }

        //copy datas to static frame buffer
        tmppkg = pkg;
        dst      = &gTxBuffer[0];
        do
        {
            src = (tmppkg->buf + tmppkg->offset);
            memcpy(dst,src,tmppkg->datalen);
            dst      += tmppkg->datalen;
            len      += tmppkg->datalen;
            if(PKG_ISLISTEND(tmppkg))
            {
                tmppkg = NULL;
                break;
            }
            else
            {
                tmppkg = tmppkg->partnext;
            }
        }while(NULL != tmppkg );

        if(len < EthTxBufSize)
        {
            if(ENET_SendFrame(EthHandle->base, &EthHandle->handle,\
                            &gTxBuffer[0], len)==kStatus_Success)
            {
                pDrive->debuginfo.sndOkTimes++;
                result = true;
            }
        }
        else
        {
            pDrive->debuginfo.sndPkgTooLongCnt++;
        }

NODESCERROR:
        Lock_MutexPost(pDrive->protect);
    }

    return result;
}

u32 ETH_SendData(u8 *buf,u32 len)
{
    tagNetPkg          pkg;
    tagMacDriver      *pDrive;

    pDrive = &gMacDriver;

    pkg.partnext = NULL;
    pkg.pkgflag  = (1<<0);  //只有一个包
    pkg.offset   = 0;
    pkg.datalen  = len;
    pkg.buf      = buf;
    if(MacSnd(pDrive->devhandle,&pkg,len,0))
    {
        return len;
    }
    else
    {
        return 0;
    }
}

static bool_t MacCtrl(ptu32_t devhandle,u8 cmd,ptu32_t para)
{
    bool_t result = false;
    tagMacDriver   *pDrive;
    pDrive = &gMacDriver;
    if((pDrive->devhandle == devhandle)&&\
        (Lock_MutexPend(pDrive->protect,CN_TIMEOUT_FOREVER)))
    {
        switch(cmd)
        {
            case EN_NETDEV_SETNOPKG:
                if(para)
                {
                    ETH_HardDrvInit(pDrive);
                    pDrive->debuginfo.rsttimes++;
                }
                result = true;
                break;
            case EN_NETDEV_SETBORAD:
                if(para)
                {
                    if((pDrive->EthHandle->config.macSpecialConfig & \
                            (~kENET_ControlRxBroadCastRejectEnable))!=0)
                    {
                        pDrive->EthHandle->config.macSpecialConfig &= \
                                                (~kENET_ControlRxBroadCastRejectEnable);
                        pDrive->EthHandle->base->RCR &= ~ENET_RCR_BC_REJ_MASK;
                    }
                    printk("mac broad enable\n\r");
                    pDrive->macstat.bfd = 0;
                }
                else
                {
                    pDrive->EthHandle->config.macSpecialConfig |= \
                                            kENET_ControlRxBroadCastRejectEnable;
                    pDrive->EthHandle->base->RCR |= ENET_RCR_BC_REJ_MASK;
                    printk("mac broad disable\n\r");
                    pDrive->macstat.bfd = 1;
                }
                result = true;
                break;
            case EN_NETDEV_SETPOINT:
                result = true;
                break;
            case EN_NETDEV_SETMULTI:
               result = true;
                break;
            case EN_NETDEV_SETRECV:
                if(para)
                {
                    pDrive->EthHandle->base->RDAR = ENET_RDAR_RDAR_MASK;
                }
                else
                {
                    pDrive->EthHandle->base->RDAR &= ~ENET_RDAR_RDAR_MASK;
                }
                result = true;
                break;
            case EN_NETDEV_SETSEND:
                if(para)
                {
                    ETH_HardDrvInit(pDrive);
                }
                else
                {
                    ENET_Deinit(pDrive->EthHandle->base);
                }
                break;
            case EN_NETDEV_SETMAC:
                memcpy(pDrive->macaddr,(u8 *)para, CN_MACADDR_LEN);
                ETH_HardDrvInit(pDrive);
                pDrive->debuginfo.rsttimes++;
                result = true;
                break;
            case EN_NETDEV_SETMULTIMAC:
                break;
            case EN_NETDEV_GTETMAC:
                if((u8 *)para != NULL)
                {
                    memcpy((u8 *)para,pDrive->macaddr, CN_MACADDR_LEN);
                    result = true;
                }
                break;
            case EN_NETDEV_RESET:
                if(para)
                {
                    ENET_Reset(pDrive->EthHandle->base);
                    ETH_HardDrvInit(pDrive);
                    pDrive->debuginfo.rsttimes++;
                    result = true;
                }
                break;
            default:
                result = false;
                break;
        }
        Lock_MutexPost(pDrive->protect);
    }

    return result;
}

static ptu32_t __MacRcvTask(void)
{
    tagNetPkg *pkg=NULL;
    ptu32_t    handle;
    u8        *rawbuf;
    u16        len;
    tagMacDriver      *pDrive;
    pDrive = &gMacDriver;

    Djy_GetEventPara(&handle,NULL);
    while(1)
    {
        Lock_SempPend(pDrive->rcvsync,pDrive->loopcycle);
        pDrive->debuginfo.rxTaskRun++;
        while(1)
        {
            if(Lock_MutexPend(pDrive->protect,CN_TIMEOUT_FOREVER))
            {
                pkg = __MacRcv(handle);
                Lock_MutexPost(pDrive->protect);
            }
            if(NULL != pkg)
            {
                //maybe we have another method like the hardware
                //NetDevFlowCounter(handle,NetDevFrameType(pkg->buf+ pkg->offset,pkg->datalen));
                //you could alse use the soft method
                if(NULL != pDrive->fnrcvhook)
                {
                    rawbuf = pkg->buf + pkg->offset;
                    len = pkg->datalen;
                    pDrive->fnrcvhook(rawbuf,len);
                }
                else
                {
                    NetDevPush(handle,pkg);
                }
                PkgTryFreePart(pkg);
                pDrive->debuginfo.rcvPkgTimes++;
            }
            else
            {
                  //here we still use the counter to do the time state check
                //NetDevFlowCounter(handle,EN_NETDEV_FRAME_LAST);
                break;
            }
        }
    }
    return 0;
}

