china-djyos/djyos/bsp/cpudrv/imxrt/1050/src/eth/cpu_peri_eth.c
static bool_t __CreateRcvTask(ptu32_t handle)
{
    bool_t result = false;
    u16 evttID;
    u16 eventID;

    evttID = Djy_EvttRegist(EN_CORRELATIVE, CN_PRIO_REAL, 0, 1,
        (ptu32_t (*)(void))__MacRcvTask,NULL, 0x800, "GMACRcvTask");
    if (evttID != CN_EVTT_ID_INVALID)
    {
        eventID=Djy_EventPop(evttID, NULL,  0,(ptu32_t)handle, 0, 0);
        if(eventID != CN_EVENT_ID_INVALID)
        {
            result = true;
        }
        else
        {
            Djy_EvttUnregist(evttID);
        }
    }
    return result;
}

//show the gmac status
bool_t macdebuginfo(char *param)
{
    s64  time;
    u32  timeS;
    tagMacDriver      *pDrive;
    pDrive = &gMacDriver;

    time = DjyGetSysTime();
    timeS = time/(1000*1000);
    if(timeS == 0)
    {
        timeS =1;
    }
    u32 rcvSpeed = pDrive->debuginfo.rcvPkgTimes/timeS;
    u32 intSpeed = pDrive->debuginfo.Ints/timeS;

    debug_printf("*********MAC DEBUG INFO***********\n\r");
    if(pDrive->loop)
    {
        debug_printf("loop/int      :loop\n\r");
        debug_printf("loopcycle     :%d mS\n\r",pDrive->loopcycle);
    }
    else
    {
        debug_printf("loop/int      :int\n\r");
    }

    debug_printf("EthInts       :%d\n\r",pDrive->debuginfo.Ints);
    debug_printf("rcvInts       :%d\n\r",pDrive->debuginfo.rcvInts);
    debug_printf("rcvPkgCnt     :%d\n\r",pDrive->debuginfo.rcvPkgTimes);
    debug_printf("rxoInts       :%d\n\r",pDrive->debuginfo.rxoverInts);
    debug_printf("dmaerrcnt     :%d\n\r",pDrive->debuginfo.dmaerr);
    debug_printf("snd           :%d\n\r",pDrive->debuginfo.sndTimes);
    debug_printf("sndInts       :%d\n\r",pDrive->debuginfo.sndInts);
    debug_printf("sndTimes      :%d\n\r",pDrive->debuginfo.sndTimes);
    debug_printf("sndOkTime     :%d\n\r",pDrive->debuginfo.sndOkTimes);
    debug_printf("sndnobdCnt    :%d\n\r",pDrive->debuginfo.sndnobdCnt);
    debug_printf("rxTaskRun     :%d\n\r",pDrive->debuginfo.rxTaskRun);
    debug_printf("rcvSpeed      :%d\n\r",rcvSpeed);
    debug_printf("intSpeed      :%d\n\r",intSpeed);
    debug_printf("rstTimes      :%d\n\r",pDrive->debuginfo.rsttimes);
    debug_printf("**********************************\n\r");
    return true;
}

bool_t MacReset(char *param)
{
    tagMacDriver   *pDrive = &gMacDriver;

    __MacReset(pDrive);
    return true;
}

#include <shell.h>
static struct shell_debug gMacDebug[] =
{
    {
        "mac",
        macdebuginfo,
        "usage:gmac",
        NULL
    },
//    {
//        "macreg",
//        MacReg,
//        "usage:MacReg",
//        NULL
//    },
//    {
//        "macpost",
//        gmacpost,
//        "usage:gmacpost",
//        NULL
//    },
//    {
//        "macrcvbd",
//        gmacrcvbdcheck,
//        "usage:gmacrcvbd",
//        NULL
//    },
//    {
//        "macsndbd",
//        gmacsndbdcheck,
//        "usage:gmacsndbd",
//        NULL
//    },
    {
        "macreset",
        MacReset,
        "usage:reset gmac",
        NULL
    },
//    {
//        "macdelay",
//        MacDelay,
//        "usage:MacDelay",
//        NULL
//    },
//    {
//        "macsndbdclear",
//        MacSndBDClear,
//        "usage:MacSndBdClear + ndnum",
//        NULL
//    }
//    {
//        "macsnden",
//        MacSndEn,
//        "usage:MacSndEn",
//        NULL
//    },
//    {
//        "macsnddis",
//        MacSndDis,
//        "usage:MacSndDis",
//        NULL
//    },
};

#define CN_GMACDEBUG_NUM  ((sizeof(gMacDebug))/(sizeof(struct shell_debug)))
//static struct ShellCmdRsc gMacDebugCmdRsc[CN_GMACDEBUG_NUM];

 u32 ETH_IntHandler(ufast_t IntLine)
{
    tagMacDriver *pDrive;
    tagEthHandle *EthHandle;
    uint32_t mask = kENET_RxFrameInterrupt | kENET_RxBufferInterrupt;

    pDrive = &gMacDriver;
    EthHandle = pDrive->EthHandle;

    pDrive->debuginfo.Ints++;

     while (mask & EthHandle->base->EIR)
     {
         /* Clear the transmit interrupt event. */
         EthHandle->base->EIR = mask;
         Lock_SempPost(pDrive->rcvsync);
     }
    return 0;
}

// =============================================================================
// 功能：MAC网卡和DJYIP驱动初始化函数
// 参数：para
// 返回值  ：true成功  false失败。
// =============================================================================
bool_t ModuleInstall_ETH(const char *devname, u8 *macaddress,\
                         tagPhyMessage  *phy,
                          bool_t loop,u32 loopcycle,\
                          bool_t (*rcvHook)(u8 *buf, u16 len))
{
    tagMacDriver   *pDrive = &gMacDriver;
    tagNetDevPara   devpara;

    memset((void *)pDrive,0,sizeof(tagMacDriver));
    //copy the config para to the pDrive
    memcpy(pDrive->devname,devname,CN_DEVNAME_LEN-1);
    memcpy((void *)pDrive->macaddr,macaddress,CN_MACADDR_LEN);
    if(loop)
    {
        pDrive->loop = 1;
    }
    pDrive->loopcycle = loopcycle;
    pDrive->fnrcvhook = rcvHook;
    //set the work mode and speed
    pDrive->macstat.pm = 0;         //primmiscuous mode:= 1,no MAC addr filte
    pDrive->macstat.duplex = (phy->duplex==CPU_ETH_FULL_DUPLEX ? 1:0);    //duplex full
    pDrive->macstat.speed = (phy->speed==CPU_ETH_SPEED_100M ? 1:0);     //100 Mb
    pDrive->macstat.bfd = 0;       //broadcast frames disable
    pDrive->macstat.mii = 0;       //use RMII mode

    pDrive->EthHandle = &sEthHandle;
    pDrive->EthHandle->base = ENET;
    ENET_GetDefaultConfig(&pDrive->EthHandle->config);
    pDrive->EthHandle->config.miiSpeed = (phy->speed==CPU_ETH_SPEED_100M ?\
                                                kENET_MiiSpeed100M:kENET_MiiSpeed10M);;
    pDrive->EthHandle->config.miiDuplex = (phy->duplex==CPU_ETH_FULL_DUPLEX ? \
                                                kENET_MiiFullDuplex:kENET_MiiHalfDuplex);
    pDrive->EthHandle->config.miiMode = kENET_RmiiMode;
//  pDrive->EthHandle->config.intCoalesceCfg = &intcoalesce;
//  pDrive->EthHandle->config.intCoalesceCfg->rxCoalesceFrameCount[0] = 10;
    pDrive->EthHandle->config.interrupt = kENET_RxBufferInterrupt|kENET_RxFrameInterrupt;
    pDrive->EthHandle->config.txAccelerConfig = \
                            kENET_TxAccelIpCheckEnabled|kENET_TxAccelProtoCheckEnabled;
    pDrive->EthHandle->config.rxAccelerConfig = \
            kENET_RxAccelIpCheckEnabled|kENET_RxAccelProtoCheckEnabled;
//  pDrive->EthHandle->config.txFifoWatermark =32;
//  pDrive->EthHandle->config.rxFifoFullThreshold = 32;
    ETH_HardDrvInit(pDrive);
    //all the configuration has set in the pDrive now,we need some sys assistant
    //application some semphore and mutex
    pDrive->rcvsync = Lock_SempCreate(1,0,CN_BLOCK_FIFO,NULL);
    if(NULL == pDrive->rcvsync)
    {
        goto RCVSYNC_FAILED;
    }
    pDrive->protect = Lock_MutexCreate(NULL);
    if(NULL == pDrive->protect)
    {
        goto DEVPROTECT_FAILED;
    }

    //install the net device
    devpara.ifctrl = MacCtrl;
    devpara.ifsend = MacSnd;
    devpara.iftype = EN_LINK_ETHERNET;
    devpara.devfunc = CN_IPDEV_ALL;
    memcpy(devpara.mac,macaddress,6);
    devpara.name = (char *)pDrive->devname;
    devpara.private = 0;
    devpara.mtu = ENET_FRAME_MAX_FRAMELEN;
    devpara.private = (ptu32_t)pDrive;
    pDrive->devhandle = NetDevInstall(&devpara);
    if(0 == pDrive->devhandle)
    {
        goto NetInstallFailed;
    }
    if(false == __CreateRcvTask(pDrive->devhandle))
    {
        goto RcvTaskFailed;
    }

    if(false == loop)
    {
        Int_Register(CN_INT_LINE_ENET);
        Int_SetClearType(CN_INT_LINE_ENET,CN_INT_CLEAR_AUTO);
        Int_IsrConnect(CN_INT_LINE_ENET,ETH_IntHandler);
        Int_SettoAsynSignal(CN_INT_LINE_ENET);
        Int_ClearLine(CN_INT_LINE_ENET);
        Int_RestoreAsynLine(CN_INT_LINE_ENET);
    }

    shell_debug_add(gMacDebug, CN_GMACDEBUG_NUM);
    debug_printf("%s:Install Net Device %s success\n\r",__FUNCTION__,devname);
    return true;

RcvTaskFailed:
    NetDevUninstall(devname);
NetInstallFailed:
    Lock_MutexDelete(pDrive->protect);
    pDrive->protect = NULL;
DEVPROTECT_FAILED:
    Lock_SempDelete(pDrive->rcvsync);
    pDrive->rcvsync = NULL;
RCVSYNC_FAILED:
debug_printf("%s:Install Net Device %s failed\n\r",__FUNCTION__,devname);
    return false;
}


